/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_echo.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hmiso <hmiso@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/02 11:46:29 by hmiso             #+#    #+#             */
/*   Updated: 2020/11/02 18:23:32 by hmiso            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


#include "../minishel.h"

void			ft_echo(char **line, t_vars *vars)//команда echo 
{
	int i;
	i = 1;
	while(line[i] != NULL)
	{
		if (line[i][0] == '$')
		{
			ft_putstr_fd(init_patch(vars, &line[i][1]), 1);
			i++;
			if(line[i] != NULL)
				write(1, " ", 1);
		}
		else
		{
			ft_putstr_fd(line[i], 1);
			i++;
			if(line[i] != NULL)
				write(1, " ", 1);			
		}
	}
	write(1, "\n", 1);
}

// не правильно работает с вызовом в несколько аргументов
// протести и поправь плз
// парсинг экранирования кавычек и всего еже с ним
// утечки
