/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_pwd.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hmiso <hmiso@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/02 11:19:32 by hmiso             #+#    #+#             */
/*   Updated: 2020/11/02 11:23:10 by hmiso            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../minishel.h"

void	ft_pwd(void)
{
	char *ptr;
	
	ft_putstr_fd((ptr = getcwd(NULL,0)), 1);
	write(1, "\n",1);
	free(ptr);
	ptr = NULL;
}

//проверить работоспособность на разных кейсах (хз каких)
//по идее все должно быть ок
// на всякий случай почитай спецификации к pwd в друг я что упустил
